WELCOME_TEXT = """
─────────୨୧─────────

Спасибо, что решили отправить заявку!

Я занимаюсь поиском новых лиц для международных материнских агентств и помогаю моделям с их продвижением.

Все заявки я просматриваю лично, поэтому для меня очень важно, чтобы материалы были подготовлены правильно.

Ниже вы найдёте всю необходимую информацию для подачи заявки.

─────────୨୧─────────
"""

REQUIREMENTS_TEXT = """
─────────୨୧─────────

📑 Подготовка заявки

☑ Ознакомиться с требованиями

Перед заполнением анкеты, пожалуйста, внимательно ознакомьтесь со всеми разделами ниже.
Это поможет правильно подготовить материалы и избежать ошибок, из-за которых рассмотрение может занять больше времени.

Обратите внимание: отправка заявки не гарантирует приглашение в агентство или подписание контракта.
Каждая заявка проходит индивидуальное рассмотрение букером.

Выберите интересующий раздел:

─────────୨୧─────────
"""

APPLICATION_FORMAT_TEXT = """
─────────୨୧─────────

📝 Формат заявки

Для рассмотрения необходимо отправить ОДНО СООБЩЕНИЕ, оформленное по шаблону ниже.

Пожалуйста, не меняйте названия полей и не пропускайте пункты!
────
Name:
Age:
Height:
Measurements: (bust / waist / hips)
Nationality: (по паспорту)
City of departure:

Modeling experience:
(если есть опыт, кратко опишите его)

Book (при наличии):
(ссылка Google Drive)

Snaps:
(ссылка Google Drive)
────
❗ Важно

• Используйте только Google Drive.

• Не используйте Яндекс.Диск, iCloud, Dropbox и др.

Это связано с тем, что агентства находятся в разных странах, и некоторые платформы могут быть недоступны.

• Обязательно откройте доступ к дискам в настройках конфиенциальности:
«Все, у кого есть ссылка».

• Если у вас нет опыта работы моделью — просто укажите "No experience". Это не является причиной отказа.

─────────୨୧─────────
"""

SNAPS_TEXT = """
─────────୨୧─────────

📸 Как сделать снепы дома или в студии

Снепы — это максимально простые фотографии без обработки, по которым агентство оценивает вашу внешность.

Требования:

• дневной естественный свет!! самое важное, обратите внимание;
• без фильтров и ретуши;
• без макияжа или с минимальным устранением мелких недостатков;
• волосы убраны назад, не закрывают лицо;
• в черном раздельном купальнике для девушек и в шортах для мужчин,
так же допускается облегающая однотонная одежда, которая не будет скрывать большие участки тела;
• босиком;
• нейтральное выражение лица.

Ниже приведены примеры правильных снепов.

─────────୨୧─────────
"""


PORTRAITS_TEXT = """
─────────୨୧─────────

🖼 Требования к портретам

Портреты должны быть сделаны:

• при хорошем естественном освещении;
• без фильтров и ретуши;
• с хорошо различимыми глазами;
• чистое лицо или максимально естественный макияж, который лишь слегка корректирует мелкие несовершенства кожи;
• волосы убраны назад, не закрывают лицо;
• сделаны с расстояния примерно 1,5–2 метров, чтобы лицо выглядело естественно, без искажений.

Ниже приведены примеры подходящих портретов.

─────────୨୧─────────
"""


VIDEO_TEXT = """
─────────୨୧─────────

🎥 Видеовизитка

Запишите короткое видео на английском языке.
(15–30 секунд).

В видео:

• представьтесь;
• назовите возраст;
• рост и параметры;
• город;
• покажите поворот на 360°;
• улыбнитесь в конце.

Видео должно быть вертикальным и снятым при хорошем дневном освещении.

─────────୨୧─────────
"""


FAQ_TEXT = """
─────────୨୧─────────

❓ Частые вопросы

• Кто вы?
Меня зовут Анфиса Рубан. Уже 4-ый год я работаю моделью заграницей и за это время увидела модельную индустрию с разных сторон, приобрела опыт и профессиональные контакты, и поняла, сколько ошибок можно избежать, если рядом есть человек, который уже прошел этот путь. Именно поэтому я решила помогать начинающим моделям находить международные агентства и начинать карьеру осознанно.

• Можно ли без опыта?
Да, опыт не обязателен. В заявке просто укажите "No experience".

• Нужно ли платить?
Нет.

• Сотрудничаете ли с модельными агентствами в странах СНГ?
Нет, я работаю только с международными агентствами, занимающимися продвижением моделей на мировом рынке.

• Сколько ждать ответ?
Обычно от 1-2 дня, т.к. заявок очень много и у меня есть и другие обязанности. Я стараюсь отвечать как можно быстрее, но иногда это может занять больше времени. 

• Какой рост необходим?
Рост должен быть не менее 168 см для девушек и 181 см для мужчин.

─────────୨୧─────────
"""


APPLICATION_TEXT = """
─────────୨୧─────────

✅ Отправить заявку

Теперь просто отправьте одним сообщением заполненный шаблон выше, прикрепив фото и видео.
Я лично рассмотрю каждую анкету и дам вам обратную связь.

Спасибо за доверие! 🤍


─────────୨୧─────────
"""